The chain formed by these curve elements has multiple non-sequential intersections with the same gridline and will be ignored
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId DividedSurfaceCurveChainNonSeqIntersWithDivLines { get; }
  Visual Basic
Public Shared ReadOnly Property DividedSurfaceCurveChainNonSeqIntersWithDivLines As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ DividedSurfaceCurveChainNonSeqIntersWithDivLines {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DividedSurfaceFailures Class
  Autodesk.Revit.DB Namespace